l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_emac.c
/*
 * Copyright (C) 2012 by Rittal GmbH & Co. KG. All rights reserved.
 * Copyright (C) 2006 by egnite Software GmbH. All rights reserved.
 * Copyright (C) 2012-2016 Uwe Bonnes (bon@elektron.ikp.physik.tu-darmstadt.de)
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holders nor the names of
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
 * THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * For additional information see http://www.ethernut.de/
 *
 */

#include <cfg/arch.h>
#include <cfg/os.h>
#include <cfg/clock.h>
#include <cfg/phycfg.h>
#include <cfg/dev.h>
#include <dev/board.h>

#include <string.h>

#include <sys/atom.h>
#include <sys/heap.h>
#include <sys/thread.h>
#include <sys/event.h>
#include <sys/timer.h>
#include <sys/confnet.h>

#include <netinet/if_ether.h>
#include <net/ether.h>
#include <net/if_var.h>

#include <dev/irqreg.h>
#include <dev/gpio.h>
#include <dev/phy.h>
#include <dev/pins.h>

#include <arch/cm3/stm/stm32xxxx.h>
#include <arch/cm3/stm/stm32_clk.h>
#include <arch/cm3/stm/stm32_gpio.h>

/* WARNING: Variadic macros are C99 and may fail with C89 compilers. */
#ifdef NUTDEBUG
#include <stdio.h>
#define EMPRINTF(args,...) printf(args,##__VA_ARGS__)
#else
#define EMPRINTF(args,...)
#endif

#ifdef STM32F10X_CL /* STM32F1 */
/* None remappable EMAC pins */
# define  EMAC_MDC                   PC01
# define  EMAC_MDIO                  PA02
# define  EMAC_TX_EN                 PB11
# define  EMAC_MII_TX_CLK            PC03
# define  EMAC_TXD0                  PB12
# define  EMAC_TXD1                  PB13
# define  EMAC_TXD2                  PC02
# define  EMAC_TXD3                  PB08
# define  EMAC_MII_CLK_RMII_REF_CLK  PA01
# define  EMAC_MII_CRS               PA00
# define  EMAC_MII_COL               PA03
# define  EMAC_RX_ER                 PB10
/* PPS is defined at configurator level*/
/* Remappable pins */
# ifdef EMAC_REMAP_ENABLE
#  define EMAC_MII_RX_DV_RMII_CRS_DV PD08
#  define EMAC_RXD0                  PD09
#  define EMAC_RXD1                  PD10
#  define EMAC_RXD2                  PD11
#  define EMAC_RXD3                  PD12
# else
#  define EMAC_MII_RX_DV_RMII_CRS_DV PA07
#  define EMAC_RXD0                  PC04
#  define EMAC_RXD1                  PC05
#  define EMAC_RXD2                  PB00
#  define EMAC_RXD3                  PB01
# endif
#endif
/*
 * For the benefit of EMC the GPIO is run at the lowest speed
 * required to operate. For RMII this is 50 MHz for MII 25 MHz.
 */
#if defined(STM32F10X_CL)
# define EMAC_GPIO_SPEED        GPIO_CFG_SPEED_HIGH
#else
# ifdef PHY_MODE_MII
#  define EMAC_GPIO_SPEED       GPIO_CFG_SPEED_FAST
# else
#  define EMAC_GPIO_SPEED       GPIO_CFG_SPEED_HIGH
# endif
#endif

#ifndef NUT_THREAD_NICRXSTACK
#define NUT_THREAD_NICRXSTACK   1024
#endif

#ifndef EMAC_RX_BUFFERS
#define EMAC_RX_BUFFERS         32
#endif
#define EMAC_RX_BUFSIZ          128

#define EMAC_TX_BUFFERS         2
#ifndef EMAC_TX_BUFSIZ
#define EMAC_TX_BUFSIZ          1536
#endif

 /*!
 * \brief Network interface controller information structure.
 */
struct _EMACINFO {
#ifdef NUT_PERFMON
    uint32_t ni_rx_packets;       /*!< Number of packets received. */
    uint32_t ni_tx_packets;       /*!< Number of packets sent. */
    uint32_t ni_overruns;         /*!< Number of packet overruns. */
    uint32_t ni_rx_frame_errors;  /*!< Number of frame errors. */
    uint32_t ni_rx_crc_errors;    /*!< Number of CRC errors. */
    uint32_t ni_rx_missed_errors; /*!< Number of missed packets. */
#endif
    HANDLE volatile ni_rx_rdy;  /*!< Receiver event queue. */
    HANDLE volatile ni_tx_rdy;  /*!< Transmitter event queue. */
    HANDLE ni_mutex;            /*!< Access mutex semaphore. */
    volatile int ni_tx_queued;  /*!< Number of packets in transmission queue. */
    volatile int ni_tx_quelen;  /*!< Number of bytes in transmission queue not sent. */
    volatile int ni_insane;     /*!< Set by error detection. */
    int ni_iomode;              /*!< 8 or 16 bit access. 32 bit is not supported. */
};

/*!
 * \brief Network interface controller information type.
 */
typedef struct _EMACINFO EMACINFO;

/*
 * TODO: Buffers and their descriptors should be part of the EMACINFO
 * structure. Actually there will be no dual Ethernet chip (sure?),
 * but just to keep the code clean.
 */
typedef struct _TBufDescriptor {
    uint32_t TDES0;
    uint32_t TDES1;
    uint32_t TDES2;
    uint32_t TDES3;
} TBufDescriptor_t;

typedef struct _RBufDescriptor {
    uint32_t RDES0;
    uint32_t RDES1;
    uint32_t RDES2;
    uint32_t RDES3;
} RBufDescriptor_t;

static volatile TBufDescriptor_t txBufTab[EMAC_TX_BUFFERS];
static volatile uint8_t txBuf[EMAC_TX_BUFFERS * EMAC_TX_BUFSIZ] __attribute__ ((aligned(8)));
static unsigned int txBufIdx = 0;

static volatile RBufDescriptor_t rxBufTab[EMAC_RX_BUFFERS];
static volatile uint8_t rxBuf[EMAC_RX_BUFFERS * EMAC_RX_BUFSIZ] __attribute__ ((aligned(8)));
static unsigned int rxBufIdx = 0;
static uint32_t mii_clk_range;

static unsigned int nic_phy_addr = NIC_PHY_ADDR;


#define TDES0_OWN           0x80000000  /* Bit set: descriptor is owned by DMA */
#define TDES0_IC            0x40000000  /* Set transmit interrupt after transmission */
#define TDES0_LS            0x20000000  /* Indicates last segment of the frame */
#define TDES0_FS            0x10000000  /* Indicates first segment of the frame */
#define TDES0_DC            0x08000000  /* Disable CRC on transmit frame */
#define TDES0_DP            0x04000000  /* Disable padding on short frames */
#define TDES0_TTSE          0x02000000  /* Transmit time stamp enable */
#define TDES0_CIC_DIS       0x00000000  /* Checksum insertion disabled */
#define TDES0_CIC_IP        0x00400000  /* Checksum only for ip header */
#define TDES0_CIC_FULL      0x00800000  /* Checksum for header and payload */
#define TDES0_CIC_ALL       0x00C00000  /* Checksum for header and payload + pseudo header */
#define TDES0_TER           0x00200000  /* Indicates final descriptor */
#define TDES0_TCH           0x00100000  /* Second address points to next descriptor */
#define TDES0_TTSS          0x00020000  /* Indicates time stamp captured for transmit frame */
#define TDES0_IHE           0x00010000  /* MAC indicates ip header error */
#define TDES0_ES            0x00008000  /* Error summary */
#define TDES0_JT            0x00004000  /* MAC indicates jabber timeout */
#define TDES0_FF            0x00002000  /* Indicates that DMA flushed the frame */
#define TDES0_IPE           0x00001000  /* MAC indicates ip payload error */
#define TDES0_LCA           0x00000800  /* Indicates loss of carrier */
#define TDES0_NC            0x00000400  /* Carrier sense signal not asserted */
#define TDES0_LCO           0x00000200  /* Late collision occured */
#define TDES0_EC            0x00000100  /* Indicates 16 successive collisions */
#define TDES0_VF            0x00000080  /* Indicates VLAN-type frame on transmission */
#define TDES0_CC_MASK       0x00000078  /* Mask for collision counter */
#define TDES0_CC_SHIFT      3           /* Number of right shifts to get collision number */
#define TDES0_ED            0x00000004  /* Indicates excessive deferral */
#define TDES0_UF            0x00000002  /* MAC indicates underflow error on DMA access */
#define TDES0_DB            0x00000001  /* MAC defers because of the presence of the carrier */

