l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_emac.c
#define TDES1_TBS2_MASK     0x1FFF0000  /* Mask for Transmit buffer 2 size */
#define TDES1_TBS2_SHIFT    16          /* Number of right shifts to get transmit buffer 2 size */
#define TDES1_TBS1_MASK     0x00001FFF  /* Mask for Transmit buffer 1 size */
#define TDES1_TBS1_SHIFT    0           /* Number of right shifts to get transmit buffer 1 size */


#define RDES0_OWN           0x80000000  /* Bit set: Descriptor is owned by DMA */
#define RDES0_AFM           0x40000000  /* Indicates fail of destination address filter in MAC */
#define RDES0_FL_MASK       0x3FFF0000  /* Mask for frame length */
#define RDES0_FL_SHIFT      16          /* Number of right shifts to get frame length */
#define RDES0_ES            0x00008000  /* Error summary */
#define RDES0_DE            0x00004000  /* Descriptor error */
#define RDES0_SAF           0x00002000  /* Indicates fail of source address filter in MAC */
#define RDES0_LE            0x00001000  /* Indicates error in length of received frame */
#define RDES0_OE            0x00000800  /* Indicates buffer overflow */
#define RDES0_VLAN          0x00000400  /* Indicates a VLAN frame */
#define RDES0_FS            0x00000200  /* Indicates descriptor for first buffer of the frame */
#define RDES0_LS            0x00000100  /* Indicates descriptor for last buffer of the frame */
#define RDES0_IPHCE         0x00000080  /* Indicates IP header checksum error */
#define RDES0_LCO           0x00000040  /* Indicates a late collision */
#define RDES0_FT            0x00000020  /* Indicates that the received frame is of ethernet-type */
#define RDES0_RWT           0x00000010  /* Indicates receive watchdog timeout */
#define RDES0_RE            0x00000008  /* Indicates receive error during reception */
#define RDES0_DBE           0x00000004  /* Indicates non-integer multiple of bytes in frame */
#define RDES0_CE            0x00000002  /* Indicates a CRC error on received frame */
#define RDES0_PCE           0x00000001  /* Indicates payload checksum error */

#define RDES1_DIC           0x80000000  /* Disable interrupt on completed reception of frame */
#define RDES1_RBS2_MASK     0x1FFF0000  /* Receive buffer 2 size */
#define RDES1_RBS2_SHIFT    16          /* Number of right shifts to get received buffer 2 size */
#define RDES1_RER           0x00008000  /* End of ring: final descriptor of the list */
#define RDES1_RCH           0x00004000  /* Second address points to next descriptor */
#define RDES1_RBS1_MASK     0x00001FFF  /* Receiver buffer 1 size */
#define RDES1_RBS1_SHIFT    0           /* Number of right shifts to get received buffer 1 size */



/*!
 * \brief changes the PHY address.
 *
 * \param new PHY address.
 *
 * \remark this must be done before calling the Emac Init Function.
 */
void Emac_SetPhyAddr(unsigned int new_phy_addr)
{
	nic_phy_addr = new_phy_addr;
}




/*!
 * \brief Read contents of PHY register.
 *
 * \param reg PHY register number.
 *
 * \return Contents of the specified register.
 */
static uint16_t phy_inw(uint8_t reg)
{
    uint32_t tempReg;
    uint16_t val = 0;

    /* PHY read command. */
    tempReg = inr(&(ETH->MACMIIAR));
    tempReg &= 0xffff0020;
    tempReg |= ((nic_phy_addr) << 11) | ((reg & 0x1F) << 6) | ETH_MACMIIAR_MB;
    tempReg |=  mii_clk_range;
    outr(&(ETH->MACMIIAR), tempReg);

    /* Wait until PHY logic completed. */
    while (((inr(&(ETH->MACMIIAR)) & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) && val<10)
    {
        NutSleep(1);
        val++;
    }

    /* Timeout */
    if(val>=10)
    {
        val = 0xFFFF;
        EMPRINTF("phy_inw: Could not read phy register.\n");
    }

    /* Get data from PHY maintenance register. */
    val = (uint16_t) (inr(&(ETH->MACMIIDR)) & ETH_MACMIIDR_MD);

    return val;
}

/*!
 * \brief Write value to PHY register.
 *
 * \param reg PHY register number.
 * \param val Value to write.
 */
static void phy_outw(uint8_t reg, uint16_t val)
{
    uint32_t tempReg;
    uint16_t wait = 0;

    /* PHY write command. */
    outr(&(ETH->MACMIIDR), val);
    tempReg = inr(&(ETH->MACMIIAR));
    tempReg &= 0xffff0020;
    tempReg |= ((nic_phy_addr) << 11) | ((reg & 0x1F) << 6);
    tempReg |= ETH_MACMIIAR_MW | ETH_MACMIIAR_MB | mii_clk_range;
    outr(&(ETH->MACMIIAR), tempReg);

    /* Wait until PHY logic completed. */
    while (((inr(&(ETH->MACMIIAR)) & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) && wait<10)
    {
        NutSleep(1);
        wait++;
    }

    if(wait>=10)
    {
        EMPRINTF("phy_outw: Could not set phy register.\n");
    }
}

/*!
 * \brief Reset the Ethernet controller.
 *
 * \return 0 on success, -1 otherwise.
 */
static int EmacReset(void)
{
    int rc = 0;
    uint32_t phy = 0;
    int link_wait;

#ifdef STM32F10X_CL
    /* force reset emac */
    RCC->AHBRSTR |= RCC_AHBRSTR_ETHMACRST;

    /* enable clocks for emac */
    RCC->AHBENR |= RCC_AHBENR_ETHMACEN | RCC_AHBENR_ETHMACTXEN |
        RCC_AHBENR_ETHMACRXEN;

    /* release reset emac */
    RCC->AHBRSTR &= ~RCC_AHBRSTR_ETHMACRST;
#else
    RCC->AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;

    /* enable clocks for emac */
    RCC->AHB1ENR |= RCC_AHB1ENR_ETHMACEN | RCC_AHB1ENR_ETHMACTXEN |
        RCC_AHB1ENR_ETHMACRXEN;

    /* release reset emac */
    RCC->AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST;
#endif
    /* Register PHY to be able to reset it */
    rc = NutRegisterPhy( nic_phy_addr, phy_outw, phy_inw);

    /* Reset PHY
       (Note that this does not set all PHY registers to reset values!) */
    phy = 1;
    NutPhyCtl(PHY_CTL_RESET, &phy);
    NutSleep(250);

    /* Register PHY again to do all the initianlization */
    rc = NutRegisterPhy( nic_phy_addr, phy_outw, phy_inw);

#if 0
    /* Clear MII isolate. */
    phy = 0;
    NutPhyCtl(PHY_CTL_ISOLATE, &phy);
#endif

    /* Restart autonegotiation */
    phy = 1;
    NutPhyCtl(PHY_CTL_AUTONEG_RE, &phy);

    /* Wait for auto negotiation completed and link established. */
    for (link_wait = 25;; link_wait--) {
        NutPhyCtl(PHY_GET_STATUS, &phy);
        if((phy & PHY_STATUS_HAS_LINK) && (phy & PHY_STATUS_AUTONEG_OK)) {
            break;
        }
        if (link_wait == 0) {
            EMPRINTF("NO LINK!\n");
            return -1;
        }
        NutSleep(200);
    }

