l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_emac.c
    return rc;
}

/*
 * NIC interrupt entry.
 */
static void EmacInterrupt(void *arg)
{
    uint32_t isr;
    EMACINFO *ni = (EMACINFO *) ((NUTDEVICE *) arg)->dev_dcb;

    /* Read interrupt status and reset interrupt flags. */
    isr = inr(&(ETH->DMASR));
    outr(&(ETH->DMASR), 0x0001E7FF);

    /* Receiver interrupt. */
    if ((isr & ETH_DMASR_RS) != 0 || (isr & ETH_DMASR_ROS) != 0) {
        NutEventPostFromIrq(&(ni->ni_rx_rdy));
    }

    /* Transmitter interrupt. */
    if ((isr & ETH_DMASR_TS) != 0) {
        NutEventPostFromIrq(&(ni->ni_tx_rdy));
    }

    /* Handling of corrupted rx buffers is done in reception
     * routines without any additional activities here */

    /* Also clear interrupt status bits in MAC interrupt status register
     * although we do not use them now, but who knows. */
    isr = inr(&(ETH->MACSR));
}

/*!
 * \brief Fetch the next packet out of the receive buffers.
 *
 * \return 0 on success, -1 otherwise.
 */
static int EmacGetPacket(EMACINFO * ni, NETBUF ** nbp)
{
    int rc = -1;
    uint16_t fbc = 0;
    unsigned int i;

    *nbp = NULL;

    /*
     * Search the next frame start. Release any fragment.
     */
    while ((rxBufTab[rxBufIdx].RDES0 & RDES0_OWN) == 0 && (rxBufTab[rxBufIdx].RDES0 & RDES0_FS) == 0) {
        rxBufTab[rxBufIdx].RDES0 = RDES0_OWN;
        rxBufIdx++;
        if (rxBufIdx >= EMAC_RX_BUFFERS) {
            rxBufIdx = 0;
        }
    }

    /*
     * Determine the size of the next frame.
     */
    i = rxBufIdx;
    while ((rxBufTab[i].RDES0 & RDES0_OWN) == 0) {
        if ((rxBufTab[i].RDES0 & RDES0_LS) != 0) {
            if((rxBufTab[i].RDES0 & RDES0_DE) == 0) {
                fbc = (rxBufTab[i].RDES0 & RDES0_FL_MASK) >> RDES0_FL_SHIFT;
            }
            else {
                /* Release buffers with corrupted frame data */
                while((rxBufTab[rxBufIdx].RDES0 & RDES0_OWN) == 0) {
                    if((rxBufTab[rxBufIdx].RDES0 & RDES0_LS) != 0)
                    {
                        rxBufTab[rxBufIdx].RDES0 = RDES0_OWN;
                        rxBufIdx++;
                        if (rxBufIdx >= EMAC_RX_BUFFERS) {
                            rxBufIdx = 0;
                        }
                        break;
                    }
                    rxBufTab[rxBufIdx].RDES0 = RDES0_OWN;
                    rxBufIdx++;
                    if (rxBufIdx >= EMAC_RX_BUFFERS) {
                        rxBufIdx = 0;
                    }
                }
            }
            break;
        }
        i++;
        if (i >= EMAC_RX_BUFFERS) {
            i = 0;
        }
    }

    if (fbc) {
        /*
         * Receiving long packets is unexpected. Let's declare the
         * chip insane. Short packets will be handled by the caller.
         */
        if (fbc > EMAC_TX_BUFSIZ) {
            ni->ni_insane = 1;
        } else {
            *nbp = NutNetBufAlloc(0, NBAF_DATALINK, fbc);
            if (*nbp != NULL) {
                uint8_t *bp = (uint8_t *) (* nbp)->nb_dl.vp;
                unsigned int len;

                while (fbc) {
                    if (fbc > EMAC_RX_BUFSIZ) {
                        len = EMAC_RX_BUFSIZ;
                    } else {
                        len = fbc;
                    }
                    memcpy(bp, (void *) rxBufTab[rxBufIdx].RDES2, len);
                    rxBufTab[rxBufIdx].RDES0 = RDES0_OWN;
                    rxBufIdx++;
                    if (rxBufIdx >= EMAC_RX_BUFFERS) {
                        rxBufIdx = 0;
                    }
                    fbc -= len;
                    bp += len;
                }
                rc = 0;
            }
            else {
                EMPRINTF("NutNetBufAlloc Failed!\n");
            }
        }
    }

    return rc;
}

/*!
 * \brief Load a packet into the nic's transmit ring buffer.
 *
 * \param nb Network buffer structure containing the packet to be sent.
 *           The structure must have been allocated by a previous
 *           call NutNetBufAlloc(). This routine will automatically
 *           release the buffer in case of an error.
 *
 * \return 0 on success, -1 in case of any errors. Errors
 *         will automatically release the network buffer
 *         structure.
 */
static int EmacPutPacket(int bufnum, EMACINFO * ni, NETBUF * nb)
{
    int rc = -1;
    unsigned int sz;
    uint8_t *buf;

    /*
     * Calculate the number of bytes to be send. Do not send packets
     * larger than the Ethernet maximum transfer unit. The MTU
     * consist of 1500 data bytes plus the 14 byte Ethernet header
     * plus 4 bytes CRC. We check the data bytes only.
     */
    if ((sz = nb->nb_nw.sz + nb->nb_tp.sz + nb->nb_ap.sz) > ETHERMTU) {
        return -1;
    }
    sz += nb->nb_dl.sz;

    /* Disable EMAC interrupts. */
    NutIrqDisable(&sig_EMAC);

    /* TODO: Check for link. */
    if (ni->ni_insane == 0) {
        buf = (uint8_t *) (txBuf + (bufnum * EMAC_TX_BUFSIZ));
        memcpy(buf, nb->nb_dl.vp, nb->nb_dl.sz);
        buf += nb->nb_dl.sz;
        memcpy(buf, nb->nb_nw.vp, nb->nb_nw.sz);
        buf += nb->nb_nw.sz;
        memcpy(buf, nb->nb_tp.vp, nb->nb_tp.sz);
        buf += nb->nb_tp.sz;
        memcpy(buf, nb->nb_ap.vp, nb->nb_ap.sz);

        if(bufnum < (EMAC_TX_BUFFERS - 1)) {
            txBufTab[bufnum].TDES0 = TDES0_LS | TDES0_FS | TDES0_IC | TDES0_TCH;
            txBufTab[bufnum].TDES3 = (uint32_t) &(txBufTab[bufnum + 1]);
        }
        else {
            txBufTab[bufnum].TDES0 = TDES0_LS | TDES0_FS | TDES0_IC | TDES0_TER;
        }
        txBufTab[bufnum].TDES1 = ((sz & TDES1_TBS1_MASK) << TDES1_TBS1_SHIFT);
        txBufTab[bufnum].TDES2 = (uint32_t) (txBuf + (bufnum * EMAC_TX_BUFSIZ));

        /* make descriptor useable for dma controller */
        txBufTab[bufnum].TDES0 |= TDES0_OWN;

        /* trigger dma polling */
        outr(&(ETH->DMATPDR), 0);

        rc = 0;
#ifdef NUT_PERFMON
        ni->ni_tx_packets++;
#endif
    }

    /* Enable EMAC interrupts. */
    NutIrqEnable(&sig_EMAC);

