l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_emac.c
    return rc;
}

/*!
 * \brief Fire up the network interface.
 *
 * NIC interrupts must be disabled when calling this function.
 *
 * \param mac Six byte unique MAC address.
 */
static int EmacStart(const uint8_t * mac)
{
    int i;
    uint32_t regvalue;

    /* stop transmission and reception */
    outr(&(ETH->DMAOMR), (inr(&(ETH->DMAOMR)) & ~(ETH_DMAOMR_ST | ETH_DMAOMR_SR)) | ETH_DMAOMR_FTF);

    /* waiting for flush to finish */
    i=0;
    while(((inr(&(ETH->DMAOMR)) & ETH_DMAOMR_FTF) == ETH_DMAOMR_FTF) && i <100)
    {
        NutSleep(1);
        i++;
    }
    if (i >= 100)
    {
        EMPRINTF("EmacStart: Could not flush\n");
        return -1;
    }
    if (EmacReset()) {
        return -1;
    }

    /* Initialize transmit buffer descriptors using chained list */
    for (i = 0; i < EMAC_TX_BUFFERS - 1; i++) {
        txBufTab[i].TDES0 = TDES0_TCH;
        txBufTab[i].TDES1 = 0;
        txBufTab[i].TDES3 = (uint32_t) &(txBufTab[i+1]);
    }
    txBufTab[EMAC_TX_BUFFERS - 1].TDES0 = /*TDES0_TCH |*/ TDES0_TER;
    txBufTab[EMAC_TX_BUFFERS - 1].TDES1 = 0;

    /* Initialize receive buffer descriptors using chained list */
    for (i = 0; i < EMAC_RX_BUFFERS; i++) {
        rxBufTab[i].RDES0 = RDES0_OWN;
        rxBufTab[i].RDES1 = RDES1_RCH | (EMAC_RX_BUFSIZ << RDES1_RBS1_SHIFT);
        rxBufTab[i].RDES2 = (uint32_t) (rxBuf + (i * EMAC_RX_BUFSIZ));
        if (i == EMAC_RX_BUFFERS - 1) {
            rxBufTab[i].RDES1 = RDES1_RER | (EMAC_RX_BUFSIZ << RDES1_RBS1_SHIFT);
            rxBufTab[i].RDES3 = 0;
        }
        else {
            rxBufTab[i].RDES1 = RDES1_RCH | (EMAC_RX_BUFSIZ << RDES1_RBS1_SHIFT);
            rxBufTab[i].RDES3 = (uint32_t) &(rxBufTab[i+1]);
        }
    }

    /* reset dma and wait until reset is finished */
    outr(&(ETH->DMABMR), ETH_DMABMR_SR);
    i=0;
    while(((inr(&(ETH->DMABMR)) & ETH_DMABMR_SR) == ETH_DMABMR_SR)&& i <100)
    {
        NutSleep(1);
        i++;
    }
    if (i >= 100)
    {
        EMPRINTF("EmacStart: Could not reset dma\n");
        return -1;
    }

    /* Set local MAC address (used e.g. for filtering). */
    outr(&(ETH->MACA0HR), (mac[5] << 8) | mac[4]);
    outr(&(ETH->MACA0LR), (mac[3] << 24) | (mac[2] << 16) | (mac[1] << 8) | mac[0]);

    /* Set bus mode in register DMABMR */
    /* leave at reset state */

    /* Enable dma interrupts */
    outr(&(ETH->DMAIER), ETH_DMAIER_NISE | ETH_DMAIER_AISE |
        /*ETH_DMAIER_ERIE |*/ ETH_DMAIER_FBEIE | /*ETH_DMAIER_ETIE |
        ETH_DMAIER_RWTIE | ETH_DMAIER_RPSIE |*/ ETH_DMAIER_RBUIE |
        ETH_DMAIER_RIE | /*ETH_DMAIER_TUIE | ETH_DMAIER_ROIE |
        ETH_DMAIER_TJTIE | ETH_DMAIER_TBUIE | ETH_DMAIER_TPSIE |*/
        ETH_DMAIER_TIE);

    /* Set start address of descriptor lists */
    outr(&(ETH->DMATDLAR), (uint32_t) txBufTab);
    outr(&(ETH->DMARDLAR), (uint32_t) rxBufTab);

    /* clear management counters */
    outr(&(ETH->MMCCR), ETH_MMCCR_CR);

    /* setting speed and duplex to values from autonegotiation process */
    NutPhyCtl(PHY_GET_STATUS, &regvalue);

    if(regvalue & PHY_STATUS_100M)
    {
        /* set emac to 100Mbit/s */
        outr(&(ETH->MACCR), inr(&(ETH->MACCR)) | ETH_MACCR_FES);
    }
    else
    {
        /* set emac to 10Mbit/s */
        outr(&(ETH->MACCR), inr(&(ETH->MACCR)) & ~ETH_MACCR_FES);
    }
    if(regvalue & PHY_STATUS_FULLDUPLEX)
    {
        /* set emac to full duplex */
        outr(&(ETH->MACCR), inr(&(ETH->MACCR)) | ETH_MACCR_DM);
    }
    else
    {
        /* set emac to half duplex */
        outr(&(ETH->MACCR), inr(&(ETH->MACCR)) & ~ETH_MACCR_DM);
    }

    /* ToDo: Set up MAC frame filters. ATM we receive all frames */
    outr(&(ETH->MACFFR), inr(&(ETH->MACFFR)) /*| ETH_MACFFR_RA | ETH_MACFFR_PM | ETH_MACFFR_PAM*/);

    /* enable transmitter and receiver state machine */
    outr(&(ETH->MACCR), inr(&(ETH->MACCR)) | ETH_MACCR_TE | ETH_MACCR_RE);

    /* start transmission and reception */
    outr(&(ETH->DMAOMR), inr(&(ETH->DMAOMR)) | ETH_DMAOMR_ST | ETH_DMAOMR_SR
        /*testing:*/ | ETH_DMAOMR_FEF | ETH_DMAOMR_FUGF);
    /*outr(&(ETH->DMARPDR), 0);*/

    return 0;
}

/*! \fn EmacRxThread(void *arg)
 * \brief NIC receiver thread.
 *
 */
THREAD(EmacRxThread, arg)
{
    NUTDEVICE *dev;
    IFNET *ifn;
    EMACINFO *ni;
    NETBUF *nb;

    dev = arg;
    ifn = (IFNET *) dev->dev_icb;
    ni = (EMACINFO *) dev->dev_dcb;
    /*
     * This is a temporary hack. Due to a change in initialization,
     * we may not have got a MAC address yet. Wait until a valid one
     * has been set.
     */
    while (!ETHER_IS_UNICAST(ifn->if_mac)) {
        NutSleep(10);
    }

    /*
     * Do not continue unless we managed to start the NIC. We are
     * trapped here if the Ethernet link cannot be established.
     * This happens, for example, if no Ethernet cable is plugged
     * in.
     */
    while (EmacStart(ifn->if_mac)) {
        NutSleep(1000);
    }

    /* Run at high priority. */
    NutThreadSetPriority(9);

    /* Initialize the access mutex. */
    NutEventPost(&ni->ni_mutex);

    /* Clear pending interrupt flags and enable receive interrupts. */
    outr(&(ETH->DMASR), ((unsigned int)inr(&(ETH->DMASR))) | 0x0001E7FF);
    NutIrqEnable(&sig_EMAC);

    for (;;) {
        /*
         * Wait for the arrival of new packets or poll the receiver
         * every two seconds.
         */
        NutEventWait(&ni->ni_rx_rdy, 2000);

        /*
         * Fetch all packets from the NIC's internal buffer and pass
         * them to the registered handler.
         */
        while (EmacGetPacket(ni, &nb) == 0) {
            /* Discard short packets. */
            if (nb->nb_dl.sz < 60) {
                NutNetBufFree(nb);
            } else {
                (*ifn->if_recv) (dev, nb);
            }
        }

        /* We got a weird chip, try to restart it. */
        while (ni->ni_insane) {
            if (EmacStart(ifn->if_mac) == 0) {
                ni->ni_insane = 0;
                ni->ni_tx_queued = 0;
                ni->ni_tx_quelen = 0;
                NutIrqEnable(&sig_EMAC);
            } else {
                NutSleep(1000);
            }
        }
    }
}

/*!
 * \brief Send Ethernet packet.
 *
 * \todo This routine does not work.
 *
 * \param dev Identifies the device to use.
 * \param nb  Network buffer structure containing the packet to be sent.
 *            The structure must have been allocated by a previous
 *            call NutNetBufAlloc().
 *
 * \return 0 on success, -1 in case of any errors.
 */
int EmacOutput(NUTDEVICE * dev, NETBUF * nb)
{
    static uint32_t mx_wait = 5000;
    int rc = -1;
    EMACINFO *ni = (EMACINFO *) dev->dev_dcb;

