l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_emac.c
    /*
     * After initialization we are waiting for a long time to give
     * the PHY a chance to establish an Ethernet link.
     */
    while (rc) {
        if (ni->ni_insane) {
            break;
        }
        if (NutEventWait(&ni->ni_mutex, mx_wait)) {
            break;
        }

        /* Check for packet queue space. */
        if ((txBufTab[txBufIdx].TDES0 & TDES0_OWN) == TDES0_OWN) {
            if (NutEventWait(&ni->ni_tx_rdy, 500) && (txBufTab[txBufIdx].TDES0 & TDES0_OWN) == TDES0_OWN) {
                /* No queue space. Release the lock and give up. */
                NutEventPost(&ni->ni_mutex);
                break;
            }
        } else {
            if ((rc = EmacPutPacket(txBufIdx, ni, nb)) == 0) {
                txBufIdx++;
                if(txBufIdx >= EMAC_TX_BUFFERS)
                {
                    txBufIdx = 0;
                }
            }
        }
        NutEventPost(&ni->ni_mutex);
    }

    /*
     * Probably no Ethernet link. Significantly reduce the waiting
     * time, so following transmission will soon return an error.
     */
    if (rc) {
        mx_wait = 500;
    } else {
        /* Ethernet works. Set a long waiting time in case we
           temporarly lose the link next time. */
        mx_wait = 5000;
    }

    return rc;
}

/*!
 * \brief Initialize Ethernet hardware.
 *
 * Applications should do not directly call this function. It is
 * automatically executed during during device registration by
 * NutRegisterDevice().
 *
 * \param dev Identifies the device to initialize.
 */
int EmacInit(NUTDEVICE * dev)
{
    uint32_t ahb_clock;

    EMACINFO *ni = (EMACINFO *) dev->dev_dcb;
    EMPRINTF("Using Mode %s, Remap %s, nic_phy_addr %d, \n",
#ifdef PHY_MODE_MII
             "MII",
#else
             "RMII",
#endif
#ifdef EMAC_REMAP_ENABLE
             "enabled",
#else
             "disabled",
#endif
             nic_phy_addr
        );

    /* Clear EMACINFO structure. */
    memset(ni, 0, sizeof(EMACINFO));

    ahb_clock = Stm32ClockGet(HWCLK_CPU);
    if        (ahb_clock <  35000000LL) {
        mii_clk_range = ETH_MACMIIAR_CR_Div16;
    } else if (ahb_clock <  60000000LL) {
        mii_clk_range = ETH_MACMIIAR_CR_Div26;
    } else if (ahb_clock < 100000000LL) {
        mii_clk_range = ETH_MACMIIAR_CR_Div42;
#if defined(ETH_MACMIIAR_CR_Div102)
    } else if (ahb_clock < 150000000LL) {
        mii_clk_range = ETH_MACMIIAR_CR_Div62;
    } else  {
        mii_clk_range = ETH_MACMIIAR_CR_Div102;
    }
#else
    } else  {
        mii_clk_range = ETH_MACMIIAR_CR_Div62;
    }
#endif

    /* Register interrupt handler. */
    if (NutRegisterIrqHandler(&sig_EMAC, EmacInterrupt, dev)) {
        return -1;
    }

#ifdef STM32F10X_CL /* STM32F1 */
    /* disable clocks for MAC */
    RCC->AHBENR &= ~(RCC_AHBENR_ETHMACEN | RCC_AHBENR_ETHMACTXEN |
                     RCC_AHBENR_ETHMACRXEN);

    CM3BBCLR(AFIO_BASE, AFIO_TypeDef, MAPR, _BI32(AFIO_MAPR_ETH_REMAP));
#else /* STM32F2/F4 parts */
    /* disable clocks for MAC */
    RCC->AHB1ENR &= ~(RCC_AHB1ENR_ETHMACEN | RCC_AHB1ENR_ETHMACTXEN |
                     RCC_AHB1ENR_ETHMACRXEN);
#endif
    Stm32GpioConfigSet(EMAC_MII_CLK_RMII_REF_CLK, GPIO_CFG_PERIPHAL, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_RXD0,  GPIO_CFG_PERIPHAL, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_RXD1,  GPIO_CFG_PERIPHAL, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_RX_ER, GPIO_CFG_PERIPHAL, GPIO_AF_ETH);

    Stm32GpioConfigSet(EMAC_MII_RX_DV_RMII_CRS_DV, GPIO_CFG_PERIPHAL, GPIO_AF_ETH);

    Stm32GpioConfigSet(EMAC_MDIO,  GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| GPIO_CFG_SPEED_MED, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_MDC,   GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| GPIO_CFG_SPEED_MED, GPIO_AF_ETH);

    Stm32GpioConfigSet(EMAC_TX_EN, GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| EMAC_GPIO_SPEED, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_TXD0,  GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| EMAC_GPIO_SPEED, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_TXD1,  GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| EMAC_GPIO_SPEED, GPIO_AF_ETH);

    Stm32GpioConfigSet(EMAC_PPS,   GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| EMAC_GPIO_SPEED, GPIO_AF_ETH);

    if (Stm32GpioConfigSet(
            EMAC_PHY_CLOCK_MCO, GPIO_CFG_PERIPHAL | GPIO_CFG_OUTPUT |
            EMAC_GPIO_SPEED, GPIO_AF_MCO) == 0) {
        /* Output HSE clock (25MHz) on MCO pin (PA8) to clock the PHY */
        RCC->CFGR = (RCC->CFGR & ~(RCC_CFGR_MCO1 | RCC_CFGR_MCO1PRE)) |
            RCC_CFGR_MCO1_1;
    }
#if defined(PHY_MODE_MII)
    Stm32GpioConfigSet(EMAC_TXD2, GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| EMAC_GPIO_SPEED, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_TXD3, GPIO_CFG_PERIPHAL| GPIO_CFG_OUTPUT| EMAC_GPIO_SPEED, GPIO_AF_ETH);

    Stm32GpioConfigSet(EMAC_MII_TX_CLK, GPIO_CFG_PERIPHAL, GPIO_AF_ETH);

    Stm32GpioConfigSet(EMAC_MII_CRS, GPIO_CFG_PERIPHAL | EMAC_GPIO_SPEED, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_MII_COL, GPIO_CFG_PERIPHAL | EMAC_GPIO_SPEED, GPIO_AF_ETH);

    Stm32GpioConfigSet(EMAC_RXD2, GPIO_CFG_PERIPHAL, GPIO_AF_ETH);
    Stm32GpioConfigSet(EMAC_RXD3, GPIO_CFG_PERIPHAL, GPIO_AF_ETH);
  #endif /* !PHY_MODE_MII */

    /*
     * MII or RMII mode selection
     */
#if defined (SYSCFG_PMC_MII_RMII_SEL) && !defined(SYSCFG_PMC_MII_RMII)
#define SYSCFG_PMC_MII_RMII SYSCFG_PMC_MII_RMII_SEL
#endif

#ifdef PHY_MODE_MII
    /* switch to MII mode */
 #ifdef STM32F10X_CL
    CM3BBCLR(AFIO_BASE, AFIO_TypeDef, MAPR, _BI32(AFIO_MAPR_MII_RMII_SEL));
 #else
    CM3BBCLR(SYSCFG_BASE, SYSCFG_TypeDef, PMC, _BI32(SYSCFG_PMC_MII_RMII));
 #endif
#else
    /* switch to RMII mode */
 #ifdef STM32F10X_CL
    CM3BBSET(AFIO_BASE, AFIO_TypeDef, MAPR, _BI32(AFIO_MAPR_MII_RMII_SEL));
 #else
    CM3BBSET(SYSCFG_BASE, SYSCFG_TypeDef, PMC, _BI32(SYSCFG_PMC_MII_RMII));
 #endif
#endif

    /* Start the receiver thread. */
    if (NutThreadCreate("emacrx", EmacRxThread, dev,
        (NUT_THREAD_NICRXSTACK * NUT_THREAD_STACK_MULT) + NUT_THREAD_STACK_ADD) == NULL) {
        return -1;
    }
    return 0;
}

static EMACINFO dcb_eth0;

/*!
 * \brief Network interface information structure.
 *
 * Used to call.
 */
static IFNET ifn_eth0 = {
    IFT_ETHER,                  /*!< \brief Interface type, if_type. */
    0,                          /*!< \brief Interface flags, if_flags. */
    {0, 0, 0, 0, 0, 0},         /*!< \brief Hardware net address, if_mac. */
    0,                          /*!< \brief IP address, if_local_ip. */
    0,                          /*!< \brief Remote IP address for point to point, if_remote_ip. */
    0,                          /*!< \brief IP network mask, if_mask. */
    ETHERMTU,                   /*!< \brief Maximum size of a transmission unit, if_mtu. */
    0,                          /*!< \brief Packet identifier, if_pkt_id. */
    0,                          /*!< \brief Linked list of arp entries, arpTable. */
    0,                          /*!< \brief Linked list of multicast address entries, if_mcast. */
    NutEtherInput,              /*!< \brief Routine to pass received data to, if_recv(). */
    EmacOutput,                 /*!< \brief Driver output routine, if_send(). */
    NutEtherOutput,             /*!< \brief Media output routine, if_output(). */
    NULL                        /*!< \brief Interface specific control function, if_ioctl(). */
#ifdef NUT_PERFMON
    , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
#endif
};

/*!
 * \brief Device information structure.
 *
 * A pointer to this structure must be passed to NutRegisterDevice()
 * to bind this Ethernet device driver to the Nut/OS kernel.
 * An application may then call NutNetIfConfig() with the name \em eth0
 * of this driver to initialize the network interface.
 *
 */
NUTDEVICE devStm32Emac = {
    0,                          /*!< \brief Pointer to next device. */
    {'e', 't', 'h', '0', 0, 0, 0, 0, 0},        /*!< \brief Unique device name. */
    IFTYP_NET,                  /*!< \brief Type of device. */
    0,                          /*!< \brief Base address. */
    0,                          /*!< \brief First interrupt number. */
    &ifn_eth0,                  /*!< \brief Interface control block. */
    &dcb_eth0,                  /*!< \brief Driver control block. */
    EmacInit,                   /*!< \brief Driver initialization routine. */
    0,                          /*!< \brief Driver specific control function. */
    0,                          /*!< \brief Read from device. */
    0,                          /*!< \brief Write to device. */
#ifdef __HARVARD_ARCH__
    0,                          /*!< \brief Write from program space data to device. */
#endif
    0,                          /*!< \brief Open a device or file. */
    0,                          /*!< \brief Close a device or file. */
    0,                          /*!< \brief Request file size. */
    0,                          /*!< \brief Select function, optional, not yet implemented */
};

/*@}*/

